# ShouldCreateWebSite Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..ShouldCreateWebSite Property
ImageExportOptions Class See Also
---
Whether or not to create a web site with a page for each export. Used only when ExportRange is SetOfViews.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool ShouldCreateWebSite { get; set; }
```

Visual Basic
---
```text
Public Property ShouldCreateWebSite As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShouldCreateWebSite {
	bool get ();
	void set (bool value);
}
```

# Remarks
The default is false. This field is ignored if used to save an image to a project as a new view.
# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace